TODO.md

# Table of Contents

1.  [Everywhere](#org7c05353)
    1.  [Add some fucking CSS](#org22e55bb)
    2.  [Add guard not to display anything before a certain date](#orgf920272)
2.  [Admin Page](#org877ef21)
3.  [When not connected](#org5b8c955)
    1.  [Index](#org58fb8f1)
    2.  [Inscription](#org3570910)
4.  [When connected](#orgf2f1e12)
    1.  [Page d&rsquo;accueil](#org5e47456)
    2.  [Leaderboard](#org943b314)
    3.  [Page d&rsquo;equipe](#org0d63538)
    4.  [Page de contact](#orga8cd599)
    5.  [Page de profil](#org63d9e29)
    6.  [Sidebar](#org67725a5)



<a id="org7c05353"></a>

# Everywhere


<a id="org22e55bb"></a>

## TODO Add some fucking CSS


<a id="orgf920272"></a>

## TODO Add guard not to display anything before a certain date


<a id="org877ef21"></a>

# TODO Admin Page

-   [ ] Ability to change password of any user.


<a id="org5b8c955"></a>

# When not connected


<a id="org58fb8f1"></a>

## TODO Index

-   [ ] add redirection when connected.
-   [ ] Display only relevant information.


<a id="org3570910"></a>

## TODO Inscription

-   [X] Display passwords at the end when sucessful.
-   [ ] Be more clear on what is expected in each field.
-   [ ] Send an email to validate inscription


<a id="orgf2f1e12"></a>

# When connected


<a id="org5e47456"></a>

## TODO Page d&rsquo;accueil

-   [ ] Presentation du concours
-   [ ] Reglement
-   [ ] Deroulement (horaire + specifite en ligne)
-   [ ] Sponsor


<a id="org943b314"></a>

## TODO Leaderboard

-   [ ] Accessible pour les non-connectes (highlight quand on est connecte)
-   [ ] En temps reel


<a id="org0d63538"></a>

## TODO Page d&rsquo;equipe

-   [ ] Score actuel
-   [ ] Derniere submission
-   [ ] Submission d&rsquo;un nouveau resultat
-   [ ] Graphe de l&rsquo;evolution du score ? (Optionnal)


<a id="orga8cd599"></a>

## TODO Page de contact

-   [ ] Mails et numero de telephones des orgas
-   [ ] Lien vers le discord/slack du concours


<a id="org63d9e29"></a>

## TODO Page de profil

-   [ ] Changement de mot de passe
-   [ ] Photo de profil ?
-   [ ] Rectification champs


<a id="org67725a5"></a>

## TODO Sidebar

-   [ ] Lien vers les onglets precedents
-   [ ] Bouton de deconnexion

